In [1]:
import pandas as pd
import numpy as np
from datetime import date

In [2]:
file_path_1 = r'C:\Users\tolania\OneDrive - Amni International Petroleum Company\Desktop\Project 3\geodf.csv'

In [3]:
file_path_2 = r'C:\Users\tolania\OneDrive - Amni International Petroleum Company\Desktop\Project 3\FinalClean2.xlsx'

In [4]:
df1=pd.read_csv(file_path_1,low_memory=False)
df1.head(5)

    FIPS      REGION           lat         long
0  48421  West Texas  -101.6234591   36.0631349
1  48421  West Texas  -101.6234571   36.0553989
2  48421  West Texas  -101.6254351   36.0553749
3  48421  West Texas  -101.6324171  36.05537591
4  48421  West Texas  -101.6373211  36.05537691

In [9]:
df1_a=df1.REGION.unique()
df1_a

array(['West Texas', 'Amarillo', 'Wichita Falls', 'North Texas',
       'Sherman', 'Lubbock', 'Texarkana', 'Dallas', 'Abilene', 'Longview',
       'Tyler', 'Midland', 'Hill Country', 'Odessa', 'El Paso',
       'Big Thicket', 'Waco', 'Killeen-Temple', 'San Angelo',
       'College Station', 'Beaumont', 'Austin', 'Houston', 'Border',
       'San Antonio', 'Coastal Plains', 'Victoria', 'Corpus Christi',
       'Laredo', 'McAllen', 'Brownsville'], dtype=object)

In [25]:
df1_b = df1[df1['REGION'] =='North Texas']

df1_b.head(5)

    FIPS       REGION           lat         long
0  48421  North Texas  -101.6234591   36.0631349
1  48421  North Texas  -101.6234571   36.0553989
2  48421  North Texas  -101.6254351   36.0553749
3  48421  North Texas  -101.6324171  36.05537591
4  48421  North Texas  -101.6373211  36.05537691

In [21]:
df1_c=df1_b.lat.unique()
df1_c

array(['-101.6234591', '-101.6234571', '-101.6254351', ...,
       '-98.58566478', '-97.44660056', '-97.22591848'], dtype=object)

In [34]:
df1_e = pd.DataFrame(data =df1_c)
df1_e.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 95776 entries, 0 to 95775
Data columns (total 1 columns):
0    95776 non-null object
dtypes: object(1)
memory usage: 748.3+ KB

In [32]:
df1_d=df1_b.long.unique()
df1_d

array(['36.0631349', '36.0553989', '36.0553749', ..., '26.25768796',
       '26.41062019', '25.97433779'], dtype=object)

In [23]:
df1_b.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 166739 entries, 0 to 166738
Data columns (total 4 columns):
FIPS      166739 non-null int64
REGION    166739 non-null object
lat       166739 non-null object
long      166739 non-null object
dtypes: int64(1), object(3)
memory usage: 6.4+ MB

In [26]:
df2=pd.read_excel(file_path_2)
df2.head(5)

,State,REGION,Occupation,Total_Employee,Hourly_Mean,Annual_Mean,Year,FIPS,lat,long
0,TX,Abilene,MANAGEMENT OCCUPATIONS,3230.0,24.56,51080.0,2000.0,48253.0,-100.023,32.9602
1,TX,Abilene,CHIEF EXECUTIVES,270.0,38.44,79950.0,2000.0,48253.0,-100.02,32.9602
2,TX,Abilene,GENERAL AND OPERATIONS MANAGERS,1310.0,24.34,50630.0,2000.0,48253.0,-100.018,32.9602
3,TX,Abilene,ADVERTISING AND PROMOTIONS MANAGERS,40.0,22.63,47060.0,2000.0,48253.0,-100.016,32.9602
4,TX,Abilene,MARKETING MANAGERS,60.0,24.48,50910.0,2000.0,48253.0,-100,32.9602

In [27]:
df2_a=df2.REGION.unique()
df2_a

array(['Abilene', nan, 'Amarillo', 'Austin', 'Brownsville', 'Border',
       'Big Thicket', 'Big Thicket ', 'Beaumont', 'Coastal Plains',
       'College Station', 'Corpus Christi', 'Dallas', 'El Paso',
       'Hill Country', 'Houston', 'Killeen-Temple', 'Laredo', 'Longview',
       'Lubbock', 'McAllen', 'Midland', 'North  Texas', 'Odessa',
       'San Angelo', 'San Antonio', 'Sherman', 'Texarkana', 'Tyler',
       'Victoria', 'West Texas', 'Waco', 'Wichita Falls'], dtype=object)

In [28]:
df2_b = df2[df2['REGION'] =='North  Texas']

df2_b.head(5)

,State,REGION,Occupation,Total_Employee,Hourly_Mean,Annual_Mean,Year,FIPS,lat,long
51474,TX,North Texas,ALL OCCUPATIONS,73510.0,13.86,28840.0,2006.0,48337.0,-97.5952,33.9375
51475,TX,North Texas,MANAGEMENT OCCUPATIONS,2690.0,33.29,69240.0,2006.0,48337.0,-97.5935,33.9341
51476,TX,North Texas,CHIEF EXECUTIVES,80.0,49.64,103240.0,2006.0,48337.0,-97.593,33.9335
51477,TX,North Texas,GENERAL AND OPERATIONS MANAGERS,1060.0,36.47,75850.0,2006.0,48337.0,-97.5922,33.9324
51478,TX,North Texas,SALES MANAGERS,100.0,50.28,104580.0,2006.0,48337.0,-97.5914,33.9314

In [29]:

df2_b.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1886 entries, 51474 to 53359
Data columns (total 10 columns):
State             1886 non-null object
REGION            1886 non-null object
Occupation        1886 non-null object
Total_Employee    1886 non-null float64
Hourly_Mean       1886 non-null float64
Annual_Mean       1886 non-null float64
Year              1886 non-null float64
FIPS              1886 non-null float64
lat               1886 non-null object
long              1886 non-null object
dtypes: float64(5), object(5)
memory usage: 162.1+ KB

In [ ]:
# df2["Year"]= df2["Year"].astype(str)
# df2["Year"]

In [ ]:
df2['Year'] = pd.to_datetime(df2['Year'], format="%Y")
df2['Year']

In [ ]:
df2

In [ ]:
df4=set(df1['REGION']).intersection(set(df2['REGION']))
df4

In [ ]:
RegionList =['Abilene','Amarillo','Austin','Beaumont','Big Thicket','Border','Brownsville','Coastal Plains','College Station','Corpus Christi','Dallas',
 'El Paso','Hill Country','Houston','Killeen-Temple','Laredo','Longview','Lubbock','McAllen','Midland','Odessa','San Angelo','San Antonio','Sherman',
'Texarkana','Tyler','Victoria','Waco','West Texas','Wichita Falls']

In [ ]:
df_new=  pd.concat([df1, df2], axis=1, sort=False)
df_new=df_new.drop( columns='Unnamed: 0')
# df_new=df_new.drop( columns='Unnamed: 0_y')
df_new.head(5)

In [ ]:
df_new3=pd.merge(df1, df2, on='REGION',how='inner')
df_new3

In [ ]:
df_new1=  pd.concat([df2, df1], axis=1, sort=False)
# df_new=df_new.drop( columns='Unnamed: 0_x')
# df_new=df_new.drop( columns='Unnamed: 0_y')
df_new1.head()

In [ ]:
df_new1.info()

In [ ]:
df_new=df_new.drop( columns=['Unnamed: 0_x','Unnamed: 0_y'])

df_new.head(5)

In [ ]:
df_new['State']= df_new['State'].astype(str)

In [ ]:
df_new=df_new.dropna(how='any')

In [ ]:
df_new.info()

In [ ]:
df_new.head(5)

In [ ]:
df3=df3.drop( columns=['Unnamed: 0'])

In [ ]:
df_new_2= pd.merge(df2,df3, on= 'REGION', how= 'inner' )
df_new_2.head(5)

In [ ]:
df_new.to_csv('joinedyearformatted.csv')

In [ ]:
df2.to_csv('FinalClean3.csv')

In [ ]:
df_new_2= pd.merge(df2,df3, on= 'REGION', how= 'inner' )
df_new_2.head(5)